//MATEDGR JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP01  EXEC PGM=IKJEFT01
//SYSOUT   DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
  EX 'MATEDG.LAB.REXX(SUMEVEN)'
/*
